# Завдання 5
# Є рядок, в якому зберігаються 1000 слів. Створіть словник із ключами - унікальними словами та значеннями - кількістю повторів кожного слова у послідовності.

txt = (
    "У селі Білокриницькому, де зібралися всі жителі, відбулося велике свято. Місцеві мешканці вирішили відзначити важливу річницю від дня заснування села. "
    "Всюди, де тільки сягав погляд, розташувалися шатри та намети, в яких горіли вогнища, і готувалися смачні страви. На цьому святі було багато розваг для мешканців села. Вони грали у різні ігри, організовували змагання та конкурси. "
    "Була також і виставка ремесел, де кожен мав можливість побачити та придбати унікальні вироби місцевих майстрів"
    "Однією з головних подій свята стала виставка сільськогосподарської техніки. Місцеві фермери продемонстрували сучасні трактори та інші сільгоспмашини, які значно полегшили їхню роботу на полях. Величезний інтерес у гостей викликали "
    "також виступи місцевих аматорських колективів та виконання народних пісень."
    "Свято тривало до пізньої ночі, і кожен, хто взяв участь у цих заходах, відчував неймовірне задоволення. "
    "Це був чудовий день для всіх мешканців села Білокриницького, який запам'ятається їм надовго. "
    "Наступного року вони з нетерпінням чекали нового свята, де знову зберуться всі разом, щоб святкувати та відпочивати разом зі своїми рідними та друзями.")

txt_remove = ('.', '?', ',', '!')

txt_list = txt.lower().replace('.', '').replace('?', '').replace(',', '').replace('!', '').split(' ')
trim_words = [word.strip() for word in txt_list]

uniq = set(trim_words)

for word in uniq:
    cnt = trim_words.count(word)
    if len(word) > 1:
        print(f'Слово {word.upper()} повторюється {cnt} раз')
    else:
        continue
print(' ')
print(f'Всього в тексті {len(uniq)} слів (без врахування сполучників)')
