# Завдання 2
# Створіть програму, яка емулює роботу сервісу зі скорочення посилань.
# Повинна бути реалізована можливість введення початкового посилання та короткої назви і отримання початкового посилання за її назвою.

my_dict = {}
print(
    'Давайте створимо бібліотеку посилань.\n'
    'Вам потрібно буде ввести посилання, та скорочену (зручну для вас) форму посилання.\n'
    'Якщо ви бажаєте припинити ввід - введіть STOP')
long = ''
short = ''

while True:
    print(' ')
    short = input('Введіть коротку адресу посилання: ')
    if short.upper() == 'STOP':
        break
    elif short in my_dict:
        print('Вибачте, таке коротке значення вже є... Спробуйте іншу комбінацію для короткого значення')
    else:
        long = input('Введіть, будь ласка, повну адресу посилання: ')
        if long.upper() == 'STOP':
            break
        else:
            my_dict.update({short: long})

q = input('Дякую, бібліотека створена. Бажаєте перевірити її вміст? (1-так, 0 - ні)\n')
if q == '1':
    for item in my_dict.items():
        print(item)

user_short = input('Введіть будь ласка коротке посилання ')
print('Ваше довге посилання: ', my_dict[user_short])
