# Завдання 1
# Дано два рядки. Виведіть на екран символи, які є в обох рядках.

my_set1 = {1, 2, 3, 4, 5, 6, 7, 8, 9}
my_set2 = {5, 6, 7, 8, 9, 10, 11, 12, 13}

print('Унікальні символи в обох множинах', my_set1.union(my_set2))
