# Завдання 1
# Створіть програму, яка зчитує рядок, в якому знаходиться ПІБ користувача і перевіряє, чи складається рядок з літер, при чому кожне слово має бути записане з великої літери. Вивести результат на екран.

names = input("Будь ласка, введіть ваше прізвище, ім'я та по-батькові з великої літери через пробіл: ")
name_taple = names.split(" ")

if len(name_taple) != 3:
    print("Введена вами кількість слів не відповідає критерію ПІБ. Це неприпустимо")
    exit()
else:
    for i in name_taple:
        if not i.isalpha():
            print("В ведених вами даних присутні не буквені символи. Це недопустимо")
            exit()
        else:
            if not i[0].isupper():
                print(f"Ви ввели слово \"{i}\" з маленької букви. Це неприпустимо")
                exit()
print(f"Дякую вам, {names}, за коректну відповідь")

# Завдання 2
# Напишіть програму, в якій користувач вводить із клавіатури діапазон чисел (в діапазоні має бути не менше 5 чисел). Вивести на екран суму другого, передостаннього, а також середнього арифметичного значення даної послідовності.

us_anwer = input("Введіть будь ласка не менше 5 чисел через пробіл: ")
ans = us_anwer.split(" ")
if len(ans) < 5:
    print(f"Ви ввели {len(ans)} чисел, а потрібно було 5. Це неприпустимо")
    exit()
for i in range(len(ans)):
    if not ans[i].isdigit() or not ans[i].isdecimal():
        print(f"Як мінімум, одне з введених  вами значень не є числом")
        exit()

# Перетворюєм дані кортежу в числовий формат, щоб не робити це при кожній дії
ans_numbers = [float(num) for num in ans]

sum_res = ans_numbers[1] + ans_numbers[-2]
print(f"Сума другого ({ans_numbers[1]}) та передостанього ({ans_numbers[-2]}) числа дорівнює {sum_res}")

avrg = sum(ans_numbers) / len(ans_numbers)
print(f"Середнє арифметичне для послідовності {ans_numbers} буде складати {avrg}")

# Завдання 3
# Напишіть програму, яка на вхід отримує параметри кольору (в діапазоні від 0 до 255 для кожного кольору) у форматі RGB і виводить на екран кортеж, у якому зберігається колір.

red = input("Введіть значення червоного кольору (0-255): ")
green = input("Введіть значення зеленого кольору (0-255): ")
blue = input("Введіть значення синього кольору (0-255): ")

if red not in range(0, 256, 1) or green not in range(0, 256, 1) or blue not in range(0, 256, 1):
    print("Введені вами дані не корректні")
    exit()

RGB = [red, green, blue]
print(f"RGB: {RGB}")

# Завдання 4
# Ознайомтеся за допомогою документації з класами namedtuple та deque модуля collections. Створіть фабрику іменованих кортежів оцінок для учнів однієї групи з предметів: алгебра, геометрія, історія, інформатика, географія. Вивести дані на екран.
from collections import namedtuple, deque

Score = namedtuple('Score', ['name', 'algebra', 'geometry', 'history', 'informatics', 'geography'])
number_students = int(input("Введіть кількість учнів у класі: "))

students_scores = deque()

for i in range(1, number_students + 1):
    name = input(f"Введіть ПІБ учня {i}: ")
    algebra = int(input(f"Введіть оцінку з алгебри для учня {name}: "))
    geometry = int(input(f"Введіть оцінку з геометрії для учня {name}: "))
    history = int(input(f"Введіть оцінку з історії для учня {name}: "))
    informatics = int(input(f"Введіть оцінку з інформатики для учня {name}: "))
    geography = int(input(f"Введіть оцінку з географії для учня {name}: "))

    st_score = Score(name, algebra, geometry, history, informatics, geography)
    students_scores.append(st_score)  # Додаємо створений кортеж до черги

for score in students_scores:
    print(score)

# Завдання 5
# Напишіть програму, яка вводить з клавіатури послідовність чисел, перетворює послідовність на кортеж і виводить його відсортованим у порядку зростання.
dig = input("Введіть будь-яку послідовність чисел через пробіл: ")
numbers = [float(num) for num in dig.split()]
sorted_numbers = sorted(numbers)

print(sorted_numbers)

# Завдання 6
# Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», яка повинна знаходити згадки про меню, спортзал, обслуговування
# (за кожне знайдене співпадіння нараховується 5% знижки на наступне відвідування).
# Якщо фідбек перевищив 60 символів, відвідувачу надається додаткова знижка 15% на наступне відвідування.

answer = "Я з великим задоволенням відвідав спортзал і з радістю поділюся своїми враженнями. Меню обслуговування було дуже різноманітним та смачним. Обслуговування також залишило гарне враження, адже персонал був дуже уважним і привітним. Я вражений якістю послуг та атмосферою в цьому спортзалі. Рекомендую всім спробувати його меню та відчути теплу атмосферу обслуговування"
answer = (answer.lower())

Leng = len(answer)
print(Leng)

c_menu = answer.count('меню')
print(c_menu)

c_zal = answer.count('спортзал')
print(c_zal)

с_serv = answer.count('обслуговув')
print(с_serv)

first_bonus = ((c_menu) + (c_zal) + (с_serv)) * 0.05

print(first_bonus)

if Leng > 60:
    second_bonus = 0.15
else:
    second_bonus = 0

final_bonus = first_bonus + second_bonus

if final_bonus >= 1:
    print(
        "Ви такий чудовий клієнт, що для вас наступне відвідування безкоштовне! Ми вам навіть будемо винні грошей.....")
elif 0 < final_bonus < 1:
    print(f"Дякуємо вам за відгук! На наступне відвідування у вас знижка {int(final_bonus * 100)} відсотків")
else:
    print(f"Дякуємо вам за відгук!Чекаємо вас в нашому закладі")
