# Завдання 2
# Створіть дві функції, що обчислюють значення певних алгебраїчних виразів.
# На екрані виведіть таблицю значень цих функцій від -5 до 5 з кроком 0.5.
import numpy as np


def root(a, b) -> float:
    return a ** (1 / b)


def degree(a, b) -> float:
    return a ** b


for i in np.arange(-10, 6, 0.5):
    print(f'{root(i, i)}    {degree(i, i)}')

# Вибачте, може не зрозумів умов задачі - що є алгебраїчний вираз
# Дуже сподіваюсь, що це не вплине на ідею завдання - робота з функціями
