# Завдання 5
# # Створіть програму, яка приймає як формальні параметри зріст і вагу користувача, обчислює індекс маси тіла
# і в залежності від результату повертає інформаційне повідомлення (маса тіла в нормі, недостатня вага або слідкуйте за фігурою).
# Користувач з клавіатури вводить значення росту та маси тіла та передає ці дані у вигляді фактичних параметрів під час виклику функції.
# Програма працює доти, доки користувач не зупинить її комбінацією символів «off».

def ind(h, m):
    im = m / (h / 100) ** 2
    if im < 18.5:
        return 'Недостатня вага'
    elif im >= 18.5 and im < 25:
        return 'Маса тіла в нормі'
    else:
        return 'Слідкуйте за фігурою'


while True:
    h = input('Введіть ваш ріст у сантиметрах\n'
              '(для виходу з програми введіть OFF)\n')
    if h.lower() == 'off':
        exit()
    h = float(h)

    m = input('Введіть вашу вагу у кілограмах\n'
              '(для виходу з програми введіть OFF)\n')
    if m.lower() == 'off':
        exit()
    m = float(h)

    print(ind(h, m))
